In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass

In [2]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ········

## 1 How many copies of the film Hunchback Impossible exist in the inventory system?

In [3]:
%%sql
select count(*) as Copies from sakila.inventory as i
join sakila.film as f
on i.film_id = f.film_id
where title = 'HUNCHBACK IMPOSSIBLE';

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(6,)]

## 2 List all films whose length is longer than the average of all the films.

In [4]:
%%sql
select title, length from sakila.film
where length > (
  select avg(length) from sakila.film
)
limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('AFFAIR PREJUDICE', 117),
 ('AFRICAN EGG', 130),
 ('AGENT TRUMAN', 169),
 ('ALAMO VIDEOTAPE', 126),
 ('ALASKA PHANTOM', 136),
 ('ALI FOREVER', 150),
 ('ALLEY EVOLUTION', 180),
 ('AMERICAN CIRCUS', 129),
 ('ANALYZE HOOSIERS', 181),
 ('ANONYMOUS HUMAN', 179)]

## 3 Use subqueries to display all actors who appear in the film Alone Trip.

In [5]:
%%sql
select Actor from
(select fa.film_id, fi.title, fa.actor_id, concat(a.first_name,' ',a.last_name) as Actor from sakila.film_actor as fa
join sakila.actor as a 
on fa.actor_id = a.actor_id
join sakila.film as fi
on fa.film_id = fi.film_id) as s
where title = 'ALONE TRIP';

 * mysql+pymysql://root:***@localhost/sakila
8 rows affected.

[('ED CHASE',),
 ('KARL BERRY',),
 ('UMA WOOD',),
 ('WOODY JOLIE',),
 ('SPENCER DEPP',),
 ('CHRIS DEPP',),
 ('LAURENCE BULLOCK',),
 ('RENEE BALL',)]

## 4 Sales have been lagging among young families, and you wish to target all family movies for a promotion. Identify all movies categorized as family films.

In [6]:
%%sql
select title from
(select f.title, c.name as Category from sakila.film as f
join sakila.film_category as fc
on f.film_id = fc.film_id
join sakila.category as c
on fc.category_id = c.category_id) as s
where Category = "Family"
limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('AFRICAN EGG',),
 ('APACHE DIVINE',),
 ('ATLANTIS CAUSE',),
 ('BAKED CLEOPATRA',),
 ('BANG KWAI',),
 ('BEDAZZLED MARRIED',),
 ('BILKO ANONYMOUS',),
 ('BLANKET BEVERLY',),
 ('BLOOD ARGONAUTS',),
 ('BLUES INSTINCT',)]

## 5 Get name and email from customers from Canada using subqueries. Do the same with joins. Note that to create a join, you will have to identify the correct tables with their primary keys and foreign keys, that will help you get the relevant information.

In [7]:
%%sql
select concat(first_name , ' ' , last_name) as Customer_Name, email
from sakila.customer
where address_id in (
  select address_id
  from sakila.address
  where city_id in (
    select city_id
    from sakila.city
    where country_id in (
      select country_id
      from sakila.country
      where country = 'Canada'
     )
  )
);

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('DERRICK BOURQUE', 'DERRICK.BOURQUE@sakilacustomer.org'),
 ('DARRELL POWER', 'DARRELL.POWER@sakilacustomer.org'),
 ('LORETTA CARPENTER', 'LORETTA.CARPENTER@sakilacustomer.org'),
 ('CURTIS IRBY', 'CURTIS.IRBY@sakilacustomer.org'),
 ('TROY QUIGLEY', 'TROY.QUIGLEY@sakilacustomer.org')]

In [10]:
# or
%%sql
select concat(cu.first_name,' ',cu.last_name) as Customer_name, cu.email from sakila.customer as cu
join sakila.address as ad
on cu.address_id = ad.address_id
join sakila.city as ci
on ad.city_id = ci.city_id
join sakila.country as co
on ci.country_id = co.country_id
where co.country = "Canada";

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('DERRICK BOURQUE', 'DERRICK.BOURQUE@sakilacustomer.org'),
 ('DARRELL POWER', 'DARRELL.POWER@sakilacustomer.org'),
 ('LORETTA CARPENTER', 'LORETTA.CARPENTER@sakilacustomer.org'),
 ('CURTIS IRBY', 'CURTIS.IRBY@sakilacustomer.org'),
 ('TROY QUIGLEY', 'TROY.QUIGLEY@sakilacustomer.org')]

## 6 Which are films starred by the most prolific actor? Most prolific actor is defined as the actor that has acted in the most number of films. First you will have to find the most prolific actor and then use that actor_id to find the different films that he/she starred.

In [14]:
## most prolific author

%%sql
select actor_id from (
  select actor_id, count(film_id) as Films from sakila.film_actor
  group by actor_id
  order by Films desc
  limit 1) as s;

SyntaxError: invalid syntax (3588362469.py, line 4)

In [15]:
## films starred by the most prolific actor
%%sql
select fi.title from sakila.film_actor as fa 
join sakila.film as fi
on fa.film_id = fi.film_id
where actor_id = (
  select actor_id from (
    select actor_id, count(film_id) as Films from sakila.film_actor
    group by actor_id
    order by Films desc
  limit 1) 
as s1)
limit 10;

SyntaxError: invalid syntax (399481795.py, line 3)

## 7 Films rented by most profitable customer. You can use the customer table and payment table to find the most profitable customer ie the customer that has made the largest sum of payments

In [17]:
%%sql
# most profitable customer
select customer_id from (
  select customer_id, sum(amount) as Payments from sakila.payment
  group by customer_id
  order by Payments desc
  limit 1) 
as s;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(526,)]

In [18]:
%%sql

# films rented by most profitable customer
select title from (select pa.customer_id, pa.rental_id, re.inventory_id, i.film_id, fi.title  from sakila.payment as pa
join sakila.rental as re
on pa.rental_id = re.rental_id
join sakila.inventory as i
on re.inventory_id = i.inventory_id
join sakila.film as fi
on i.film_id = fi.film_id) as s1
where customer_id = (select customer_id from (select customer_id, sum(amount) as Payments from sakila.payment
group by customer_id
order by Payments desc
limit 1) as s2)
limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('DESTINY SATURDAY',),
 ('CYCLONE FAMILY',),
 ('SLUMS DUCK',),
 ('FIDELITY DEVIL',),
 ('SPLASH GUMP',),
 ('MISSION ZOOLANDER',),
 ('MULHOLLAND BEAST',),
 ('PRINCESS GIANT',),
 ('PARIS WEEKEND',),
 ('RACER EGG',)]

## 8 Get the client_id and the total_amount_spent of those clients who spent more than the average of the total_amount spent by each client.How many copies of the film Hunchback Impossible exist in the inventory system?

In [19]:
%%sql
select customer_id, sum(amount) as Customer_total_spent from sakila.payment
group by customer_id
having Customer_total_spent > (select round(avg(Customer_total_payment),2) as Average from (select customer_id, round(sum(amount),2) as Customer_total_payment from sakila.payment
group by customer_id) as s)
order by Customer_total_spent desc
limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[(526, Decimal('221.55')),
 (148, Decimal('216.54')),
 (144, Decimal('195.58')),
 (137, Decimal('194.61')),
 (178, Decimal('194.61')),
 (459, Decimal('186.62')),
 (469, Decimal('177.60')),
 (468, Decimal('175.61')),
 (236, Decimal('175.58')),
 (181, Decimal('174.66'))]